# ExternalResourceLoadData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceLoadData Properties
ExternalResourceLoadData Class See Also
---
The ExternalResourceLoadData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ErrorsReported | Indicates whether the IExternalResourceUIServer has reported errors for this ExternalResourceLoadData. This value can be set by the IExternalResourceUIServer in HandleLoadResourceResults(). |
| ExternalResourceType | The ExternalResourceType for which Revit is requesting data from the server. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LoadStatus | The success or failure status of the load attempt. |

# See Also
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace